NIANDU0=0.08;                    % 初始粘度η0
U=1.0e-11;                       %速度参数　　　　　　　　　　　　　%
R=0.05;                          %当量圆柱半径                      %
W=2.0e-5;                        %单位长度载荷（无量纲化）          %
G=5000;                          %材料参数（无量纲化）              %
A0=2.2e-8;                       %材料参数                          %
E0=G/A0;                         %当量弹性模量                      %
B=(sqrt(8.0*W/pi))*R;            %接触区半宽                        %
PH=E0*B/(4*R);                   %最大接触应力                      %
T=3.0*(pi^2)*U/(4*W^2);          %雷诺方程右项系数                  %
H0=0;                            %初始膜厚                          %
XP(1)=-2.5;                                                           %
XP(N+1)=1;                                                          %
D=(XP(N+1)-XP(1))/N;             %步长                              %
for i= 2:N                                                          %
    XP(i)=XP(1)+(i-1)*D;         %各节点值                          %
end   